nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Remove corresponding app from rotation
    char appId[32];
    snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name);
    appRemove(appId);

    Serial.printf("[TRACKER] Removed: %s\n", name);
    return true;
}

void trackerInit() {
    memset(trackers, 0, sizeof(trackers));
    trackerCount = 0;
    Serial.println("[TRACKER] Initialized");
}

// Parse color from JSON (hex string "#FF8800", RGB array [255,136,0], or raw uint32)
uint32_t parseColorValue(JsonVariant colorVar, uint32_t defaultColor) {
    if (colorVar.isNull()) return defaultColor;

    if (colorVar.is<JsonArray>()) {
        JsonArray arr = colorVar.as<JsonArray>();
        if (arr.size() == 3) {
            return ((uint32_t)arr[0].as<uint8_t>() << 16) |
                   ((uint32_t)arr[1].as<uint8_t>() << 8) |
                   (uint32_t)arr[2].as<uint8_t>();
        }
    } else if (colorVar.is<const char*>()) {
        const char* str = colorVar.as<const char*>();
        if (str[0] == '#') str++;
        return strtoul(str, NULL, 16);
    } else {
        return colorVar.as<uint32_t>();
    }
    return defaultColor;
}

// Draw sparkline chart from scaled uint16 data
void drawSparkline(const uint16_t* data, uint8_t count, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
    if (count < 2) return;

    // Find data min/max for vertical scaling
    uint16_t dataMin = 65535;
    uint16_t dataMax = 0;
    for (uint8_t i = 0; i < count; i++) {
        if (data[i] < dataMin) dataMin = data[i];
        if (data[i] > dataMax) dataMax = data[i];
    }

    uint16_t dataRange = dataMax - dataMin;
    if (dataRange == 0) dataRange = 1;

    // Plot line segments between consecutive points
    for (uint8_t i = 0; i < count - 1; i++) {
        int16_t x0 = x + (int32_t)i * (w - 1) / (count - 1);
        int16_t x1 = x + (int32_t)(i + 1) * (w - 1) / (count - 1);
        // Invert Y: high value = top of chart
        int16_t y0 = y + h - 1 - (int32_t)(data[i] - dataMin) * (h - 1) / dataRange;
        int16_t y1 = y + h - 1 - (int32_t)(data[i + 1] - dataMin) * (h - 1) / dataRange;
        dma_display->drawLine(x0, y0, x1, y1, color);
    }
}

// Draw a small up/down arrow (5x5 pixels)
void drawTrackerArrow(int16_t x, int16_t y, bool up, uint16_t color) {
    if (up) {
        //   ..X..
        //   .XXX.
        //   XXXXX
        //   ..X..
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 1, y + 1, color);
        dma_display->drawPixel(x + 2, y + 1, color);
        dma_display->drawPixel(x + 3, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    } else {
        //   ..X..
        //   ..X..
        //   XXXXX
        //   .XXX.
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 2, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 1, y + 3, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 3, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    }
}

// Smart value formatting with thousand separators
void formatTrackerValue(float value, char* buffer, size_t bufSize) {
    if (value >= 1000.0f) {
        // Integer with thousand separator
        uint32_t intVal = (uint32_t)value;
        // Build string with commas from right to left
        char tmp[20];
        int len = snprintf(tmp, sizeof(tmp), "%lu", (unsigned long)intVal);
        int commas = (len - 1) / 3;
        int outLen = len + commas;
        if ((size_t)outLen >= bufSize) {
            snprintf(buffer, bufSize, "%lu", (unsigned long)intVal);
            return;
        }
        buffer[outLen] = '\0';
        int srcIdx = len - 1;
        int dstIdx = outLen - 1;
        int digitCount = 0;
        while (srcIdx >= 0) {
            buffer[dstIdx--] = tmp[srcIdx--];
            digitCount++;
            if (digitCount % 3 == 0 && srcIdx >= 0) {
                buffer[dstIdx--] = ',';
            }
        }
    } else if (value >= 1.0f) {
        snprintf(buffer, bufSize, "%.2f", value);
    } else {
        snprintf(buffer, bufSize, "%.5f", value);
    }
}

// Display tracker layout on 64x64 matrix
void displayShowTracker(TrackerData* tracker) {
    if (!tracker) return;

    dma_display->clearScreen();

    unsigned long trackerAge = millis() - tracker->lastUpdate;
    bool isStale = (trackerAge > TRACKER_STALE_TIMEOUT);

    // Color helpers
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimWhite = isStale ? dma_display->color565(60, 60, 60) : dma_display->color565(150, 150, 150);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t green = isStale ? dma_display->color565(0, 60, 0) : dma_display->color565(0, 200, 0);
    uint16_t red = isStale ? dma_display->color565(60, 0, 0) : dma_display->color565(200, 0, 0);

    uint8_t symR = (tracker->symbolColor >> 16) & 0xFF;
    uint8_t symG = (tracker->symbolColor >> 8) & 0xFF;
    uint8_t symB = tracker->symbolColor & 0xFF;
    uint16_t symbolColor565 = isStale
        ? dma_display->color565(symR / 4, symG / 4, symB / 4)
        : dma_display->color565(symR, symG, symB);

    uint8_t spkR = (tracker->sparklineColor >> 16) & 0xFF;
    uint8_t spkG = (tracker->sparklineColor >> 8) & 0xFF;
    uint8_t spkB = tracker->sparklineColor & 0xFF;
    uint16_t sparklineColor565 = isStale
        ? dma_display->color565(spkR / 4, spkG / 4, spkB / 4)
        : dma_display->color565(spkR, spkG, spkB);

    uint16_t valueColor = isStale ? dma_display->color565(60, 60, 60) : white;

    // --- Row 1: Icon + Symbol (y=0..11) ---
    CachedIcon* icon = nullptr;
    if (strlen(tracker->icon) > 0) {
        icon = getIcon(tracker->icon);
    }
    if (icon && icon->valid) {
        // Draw icon at native 8x8 at (2, 2)
        drawIconAtScale(icon, 2, 2, 1);
    }

