nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Symbol text at (13, 4) in symbolColor
    dma_display->setFont(NULL);  // Default 5x7 font
    dma_display->setTextSize(1);
    dma_display->setTextColor(symbolColor565);
    dma_display->setCursor(13, 4);
    dma_display->print(tracker->symbol);

    // --- Row 2: Price value (y=14..22) ---
    char valueBuf[20];
    formatTrackerValue(tracker->currentValue, valueBuf, sizeof(valueBuf));
    dma_display->setTextColor(valueColor);
    dma_display->setCursor(2, 16);
    dma_display->print(valueBuf);

    // Currency symbol right-aligned in TomThumb
    if (strlen(tracker->currencySymbol) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t currWidth = strlen(tracker->currencySymbol) * 4;
        dma_display->setCursor(62 - currWidth, 22);
        dma_display->print(tracker->currencySymbol);
        dma_display->setFont(NULL);  // Reset to default
    }

    // --- Row 3: Arrow + Change % (y=25..33) ---
    bool isPositive = (tracker->changePercent >= 0.0f);
    uint16_t changeColor = isPositive ? green : red;

    drawTrackerArrow(2, 27, isPositive, changeColor);

    char changeBuf[16];
    snprintf(changeBuf, sizeof(changeBuf), "%s%.2f%%",
             isPositive ? "+" : "", tracker->changePercent);
    dma_display->setTextColor(changeColor);
    dma_display->setCursor(9, 27);
    dma_display->print(changeBuf);

    // --- Separator line (y=37) ---
    drawSeparatorLine(37, dimGray);

    // --- "24h" label right-aligned (y=39) ---
    dma_display->setFont(&TomThumb);
    dma_display->setTextColor(dimWhite);
    dma_display->setCursor(51, 43);
    dma_display->print("24h");
    dma_display->setFont(NULL);

    // --- Sparkline chart (y=40..53, x=2..61) ---
    if (tracker->sparklineCount >= 2) {
        drawSparkline(tracker->sparkline, tracker->sparklineCount,
                      2, 40, 60, 14, sparklineColor565);
    }

    // --- Separator line (y=55) ---
    drawSeparatorLine(55, dimGray);

    // --- Bottom text centered (y=57..63) ---
    if (strlen(tracker->bottomText) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t textWidth = strlen(tracker->bottomText) * 4;
        int16_t textX = (DISPLAY_WIDTH - textWidth) / 2;
        dma_display->setCursor(textX, 62);
        dma_display->print(tracker->bottomText);
        dma_display->setFont(NULL);
    }

    // --- Stale badge ---
    if (isStale) {
        uint16_t staleRed = dma_display->color565(200, 0, 0);
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(staleRed);
        dma_display->setCursor(42, 6);
        dma_display->print("STALE");
        dma_display->setFont(NULL);
    }

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowWeatherClock(uint16_t appDuration) {
    // Fallback to time display if weather data is stale or missing
    unsigned long weatherAge = millis() - weatherData.lastUpdate;
    if (!weatherData.valid || weatherAge > 3600000) {
        displayShowTime();
        return;
    }

    // Use global weatherLastDrawnMinute / weatherLastUpdateDrawn
    // (reset by displayShowApp on app switch to force full redraw)

    int hours = timeClient.getHours();
    int minutes = timeClient.getMinutes();
    int seconds = timeClient.getSeconds();

    if (!settings.clockFormat24h && hours > 12) {
        hours -= 12;
    }

    bool needsFullRedraw = (weatherLastDrawnMinute != minutes) ||
                           (weatherLastUpdateDrawn != weatherData.lastUpdate);

    // Forecast pagination
    uint8_t forecastPageCount = max((uint8_t)1,
        (uint8_t)((weatherData.forecastCount + FORECAST_COLUMNS - 1) / FORECAST_COLUMNS));
    unsigned long pageInterval = (unsigned long)appDuration / forecastPageCount;

    bool pageChanged = false;
    if (forecastPageCount > 1) {
        unsigned long now = millis();
        if (now - lastForecastPageSwitch >= pageInterval) {
            forecastPage = (forecastPage + 1) % forecastPageCount;
            lastForecastPageSwitch = now;
            pageChanged = true;
        }
    }

    bool needsForecastRedraw = needsFullRedraw || pageChanged;

    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t cyan = dma_display->color565(0, 180, 255);
    uint16_t mintGreen = dma_display->color565(100, 255, 180);
    uint16_t gray = dma_display->color565(140, 140, 140);
    uint16_t amber = dma_display->color565(255, 180, 50);
    uint16_t coldBlue = dma_display->color565(80, 140, 255);
    uint16_t warmRed = dma_display->color565(255, 50, 30);
    uint16_t black = dma_display->color565(0, 0, 0);

    // ============================================================
    // Layout map (64x64 display)
    // NULL font: setCursor = top-left of glyph, char is 7px tall
    // TomThumb: setCursor = baseline, uppercase chars 5px above baseline
    // ============================================================
    // y=0-8:    current weather (icon 8x8 + temp + min/max)
    // y=10:     separator
    // y=13-19:  HH:MM (NULL font top=13) + :SS (TomThumb baseline=20)
    // y=22-28:  date (NULL font top=22)
    // y=31:     separator
    // y=32-63:  forecast (32px) - paginated by FORECAST_COLUMNS
    //   y=39:     day names (TomThumb baseline=39)
    //   y=41-48:  forecast icons (8x8)
    //   y=56:     min temps (TomThumb baseline=56)
    //   y=63:     max temps (TomThumb baseline=63)
    // ============================================================

    if (needsFullRedraw) {
        // Clear and redraw each section individually to avoid full-screen flicker

        // ---- Current weather (y=0-10) ----
        dma_display->fillRect(0, 0, DISPLAY_WIDTH, 11, black);
        int16_t weatherTextX = 2;
        const uint16_t* builtinCurrentIcon = getBuiltinWeatherIcon(weatherData.currentIcon);
        if (builtinCurrentIcon) {
            drawProgmemIcon(dma_display, builtinCurrentIcon, 1, 1, 1);
            weatherTextX = 11;
        } else {
            CachedIcon* currentIcon = getIcon(weatherData.currentIcon);
            if (currentIcon && currentIcon->valid) {
                drawIconAtScale(currentIcon, 1, 1, 1);
                weatherTextX = 11;
            }
        }

        // Temperature (NULL font, top at y=2 to align with icon)
        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(white);

        char tempStr[8];
        snprintf(tempStr, sizeof(tempStr), "%d", weatherData.currentTemp);
        dma_display->setCursor(weatherTextX, 2);
        dma_display->print(tempStr);

        // Degree symbol (small circle, superscript position)
        int16_t degreeX = weatherTextX + strlen(tempStr) * 6;
        dma_display->drawPixel(degreeX + 1, 1, white);
        dma_display->drawPixel(degreeX,     2, white);
        dma_display->drawPixel(degreeX + 2, 2, white);
        dma_display->drawPixel(degreeX + 1, 3, white);

        // "C" after degree (NULL font, same top as temp)
        int16_t cX = degreeX + 4;
        dma_display->setCursor(cX, 2);
        dma_display->print("C");

        // Today's min/max on right side (NULL font, right-aligned)
        char todayMinStr[8], todayMaxStr[8];
        snprintf(todayMinStr, sizeof(todayMinStr), "%d", weatherData.currentTempMin);
        snprintf(todayMaxStr, sizeof(todayMaxStr), "%d", weatherData.currentTempMax);
        int16_t todayMinW = strlen(todayMinStr) * 4;
        int16_t todaySlashW = 4;
        int16_t todayMaxW = strlen(todayMaxStr) * 4;
        int16_t todayTotalW = todayMinW + todaySlashW + todayMaxW;
        int16_t todayX = DISPLAY_WIDTH - todayTotalW - 1;

